Repository: salvoilmiosi/bill_layout_script
Catalog: messages/bls_*.po
Languages: it

source: All files
it: Tutti i file

source: Apply
it: Applica

source: BLS Input File
it: File di input bls

# BOX_FLAGS
source: Flags:
it: Flag:

# BOX_GOTO_LABEL
source: Label:
it: Etichetta:

# BOX_MODE
source: Mode:
it: Modalità:

# BOX_NAME
source: Name:
it: Nome:

# BOX_PAGE_LABEL
source: Box page:
it: Pagina di rettangolo:

# BOX_SPACERS
source: Spacers:
it: Spaziatori:

source: Browse
it: Sfoglia

# CANT_CALL_FROM_TOP_LEVEL
source: Cannot call {} from top level
it: Impossibile chiamare {} dal top level

# CANT_CALL_OUT_OF_TOP_LEVEL
source: Cannot call {} out of top level
it: Impossibile chiamare {} fuori dal top level

# CANT_CONVERT_TYPE_TO_TYPE
source: Cannot convert {} to {}
it: Impossibile convertire {} in {}

# CANT_OPEN_FILE
source: Cannot open file {}
it: Impossibile aprire il file {}

# CANT_PARSE_DATE
source: Cannot parse {} as a date
it: Impossibile leggere {} come data

# CANT_PARSE_NUMBER
source: Cannot parse {} as a number
it: Impossibile leggere {} come numero

source: Change Box Page
it: Cambia pagina di rettangolo

# CONFIG_CONTROL_SCRIPT_PATH
source: Control Script Filename
it: Script di Controllo

# CONFIG_GOOGLE_DRIVE_DIR
source: Google Drive Directory
it: Cartella Google Drive

# CONFIG_OPEN_DIR
source: Open Directory
it: Apri Cartella

# CONFIG_OPEN_FILE
source: Open File
it: Apri File

# CONFIG_OUTPUT_PATH
source: Reader Output Directory
it: Cartella Output

# CONFIG_PDFS_PATH
source: PDFs Directory
it: Cartella PDF

# CONFIG_PYBLS_PATH
source: Pybls File
it: File Pybls

source: Cancel
it: Annulla

source: Close
it: Chiudi

# DIALOG_TEST_READ_MODE
source: Read mode:
it: Modalità di lettura:

# DIALOG_TEST_READ_TITLE
source: Box Read Test
it: Test Lettura Rettangolo

# DUPLICATE_FUNCTION_ARG_NAME
source: Duplicate Function Argument: {}
it: Argomento funzione duplicato: {}

source: Duplicate Function Name: {}
it: Nome funzione duplicata: {}

# DUPLICATE_GOTO_LABEL
source: Duplicate label: {}
it: Etichetta goto duplicata: {}

source: Edit Box
it: Modifica Rettangolo

source: Empty View Stack
it: Stack viste vuoto

# FIND_LAYOUT
source: Stop execution when a layout is found
it: Ferma esecuzione a layout trovato

# FIND_LAYOUT_CHECKBOX
source: Flag for Find Layout
it: Flag per Trova Layout

# FUNCTION_REQUIRES_ARGSS_RANGE
source: Function {0} requires {1}-{2} arguments
it: La funzione {0} richiede {1}-{2} argomenti

# FUNCTION_REQUIRES_ARGS_EXACT
source: Function {0} requires at least {1} arguments
it: La funzione {0} richiede {1} argomenti

# FUNCTION_REQUIRES_ARGS_LEAST
source: Function {0} requires at least {1} arguments
it: La funzione {0} richiede almeno {1} argomenti

source: Indentation Size
it: Dimensioni indentazione

# INVALID_DATE_FORMAT
source: Invalid Date Format String
it: Stringa formato data non valida

source: Invalid Format String: {}
it: Stringa di formato non valida: {}

# INVALID_REGEXP
source: Invalid Regular Expression
it: Espressione regolare non valida

source: Invalid spacer flag
it: Flag spaziatore non valido

source: Invalid string constant
it: Costante stringa non valida

source: Invalid token: {}
it: Token non valido: {}

# INVALID_TOKEN_END_SCRIPT
source: Invalid 'End Script' token
it: Token 'End Script' non valido

# INVALID_TOKEN_END_SPACERS
source: Invalid 'End Spacers' token
it: Token 'End Spacers' non valido

# INVALID_TOKEN_FLAGS
source: Invalid 'Flags' token: {}
it: Token 'Flags' non valido: {}

# INVALID_TOKEN_MODE
source: Invalid 'Mode' token: {}
it: Token 'Mode' non valido: {}

# INVALID_TOKEN_RECT
source: Invalid 'Rect' token
it: Token 'Rect' non valido

source: Layout Error
it: Errore di Layout

source: layout Error (Code {})
it: Errore di Layout (Codice {})

# LAYOUT_FATAL_ERROR
source: Fatal Error
it: Errore Fatale

source: Layout Notes
it: Note di Layout

# LAYOUT_OPTIONS_DIALOG_TITLE
source: Change Layout Options
it: Cambia Opzioni Di Layout

source: Layout files
it: File layout

# MENU_CLOSE
source: &Close Ctrl-W
it: &Chiudi Ctrl-W

# MENU_CLOSE_HINT
source: Close the window
it: Chiudi la finestra

# MENU_COPY
source: &Copy Ctrl-C
it: &Copia Ctrl-C

# MENU_COPY_HINT
source: Copies selection
it: Copia la selezione

# MENU_CUT
source: &Cut Ctrl-X
it: &Taglia Ctrl-X

# MENU_CUT_HINT
source: Cuts selection
it: Taglia la selezione

# MENU_DELETE
source: &Delete Del
it: &Cancella Selezione Del

# MENU_DELETE_HINT
source: Deletes selection
it: Cancella il rettangolo selezionato

# MENU_EDIT
source: &Edit
it: &Modifica

# MENU_EDITCONTROL
source: Edit &control script
it: Modifica &script di controllo

# MENU_LOAD_PDF
source: Load &PDF Ctrl-L
it: Carica &PDF Ctrl-L

# MENU_LOAD_PDF_HINT
source: Load a PDF file
it: Carica un file PDF

# MENU_NEW
source: &New Ctrl-N
it: &Nuovo Ctrl-N

# MENU_NEW_HINT
source: Create new layout
it: Crea un Nuovo Layout

# MENU_OPEN
source: &Open... Ctrl-O
it: &Apri... Ctrl-O

# MENU_OPEN_HINT
source: Open a layout
it: Apri un Layout

# MENU_PASTE
source: &Paste Ctrl-V
it: &Incolla Ctrl-V

# MENU_PASTE_HINT
source: Pastes onto selection
it: Incolla nella selezione

# MENU_RECENT
source: &Recent layouts...
it: Apri &Recenti

# MENU_RECENT_PDF
source: Recent PDFsâ€¦
it: PDF Recenti...

# MENU_REDO
source: &Redo Ctrl-Y
it: &Ripeti Ctrl-Y

# MENU_REDO_HINT
source: Redo last operation
it: Ripeti l'ultima operazione

# MENU_SAVE
source: &Save Ctrl-S
it: &Salva Ctrl-S

# MENU_SAVEAS
source: Sa&ve as... Ctrl-Shift-S
it: Sa&lva con nome... Ctrl-Shift-S

# MENU_SAVEAS_HINT
source: Save Layout as...
it: Salva il Layout con nome...

# MENU_SAVE_HINT
source: Save the layout
it: Salva il Layout

# MENU_UNDO
source: &Undo Ctrl-Z
it: &Annulla Ctrl-Z

# MENU_UNDO_HINT
source: Undo last operation
it: Annulla l'ultima operazione

source: Not In A Loop
it: Non in un loop

source: No document open
it: Nessun documento aperto

# OPEN_CONTROL_SCRIPT_DIALOG
source: Open Control Script
it: Apri script di controllo

# OPEN_LAYOUT_DIALOG
source: Open Layout File
it: Apri File di Layout

# OPEN_PDF_DIALOG
source: Open PDF file
it: Apri File PDF

source: PDF files
it: File PDF

source: PDF Input File
it: File di input pdf

# PRINT_HELP
source: Prints help
it: Aiuto

source: Reader Data Output
it: Lettura Dati

# REQUIRED_INPUT_BLS
source: BLS File Required
it: Richiesto input bls

# SAVE_CHANGES_DIALOG
source: Save changes?
it: Salvare le modifiche?

# SAVE_LAYOUT_DIALOG
source: Save Layout File
it: Salva File di Layout

source: System Language
it: Lingua di sistema

source: Save
it: Salva

# TABLE_NUMBER
source: Table {}
it: Tabella {}

source: Test Output
it: Risultato della lettura

source: Token 'End Box' not found
it: Token 'End Box' non trovato

source: Token 'End Script' not found
it: Token 'End Script' non trovato

source: Token 'End Spacers' not found
it: Token 'End Spacers' non trovato

# TOOL_COPY
source: Copy
it: Copia

# TOOL_CUT
source: Cut
it: Taglia

# TOOL_DELETEBOX
source: Delete Box
it: Cancella rettangolo

# TOOL_FIND_LAYOUT
source: Find Layout
it: Trova Layout

# TOOL_LAYOUT_OPTIONS
source: Layout Options
it: Opzioni Layout

# TOOL_LOAD_PDF
source: Load PDF
it: Carica PDF

# TOOL_MOVEDOWN
source: Move Down
it: Muovi giù

# TOOL_MOVEPAGE
source: Move Box Between Pages
it: Sposta tra pagine

# TOOL_MOVEUP
source: Move Up
it: Muovi su

# TOOL_NEW
source: New
it: Nuovo

# TOOL_NEWBOX
source: New Box
it: Nuovo rettangolo

# TOOL_OPEN
source: Open
it: Apri

# TOOL_PAGE
source: Page
it: Pagina

# TOOL_PASTE
source: Paste
it: Incolla

# TOOL_READDATA
source: Read Data
it: Avvia Lettura

# TOOL_REDO
source: Redo
it: Ripeti

# TOOL_RESIZE
source: Resize Box
it: Ridimensiona rettangolo

# TOOL_ROTATE
source: Rotate Image
it: Ruota Immagine

# TOOL_SAVE
source: Save
it: Salva

# TOOL_SCALE
source: Scale
it: Scala

# TOOL_SELECT
source: Select
it: Seleziona

# TOOL_TEST
source: Test Box
it: Test rettangolo

# TOOL_UNDO
source: Undo
it: Annulla

# TOOL_UPDATE
source: Update
it: Aggiorna

# UNEXPECTED_TOKEN
source: Unexpected '{}'
it: Imprevisto '{}'

# UNEXPECTED_TOKEN_REQUIRED
source: Unexpected '{}', required '{}'
it: Imprevisto '{}', richiesto '{}'

source: Unknown Error
it: Errore sconosciuto

source: Unknown function: {}
it: Funzione sconosciuta: {}

source: Unknown label: {}
it: Etichetta sconosciuta: {}

# UNNAMED_BOX
source: (Unnamed)
it: (Senza nome)

# UNSUPPORTED_LANGUAGE
source: Language not supported: {}
it: Lingua non supportata: {}

# VARIABLE_NAME
source: Name
it: Nome

# VARIABLE_TYPE
source: Type
it: Tipo

# VARIABLE_VALUE
source: Value
it: Valore

# bls::box_flags::DISABLED
source: Disabled
it: Disabilita

# bls::box_flags::NOREAD
source: No Read
it: Nessuna Lettura

# bls::box_flags::PAGE
source: Read Page
it: Leggi Pagina

# bls::box_flags::SPACER
source: No Spacer
it: Spaziatore

# bls::box_flags::TRIM
source: Trim Spaces
it: Taglia Spazi

# bls::read_mode::RAW
source: Raw
it: Grezza

# bls::variable_type::ARRAY
source: list
it: lista

# bls::variable_type::BOOLEAN
source: boolean
it: booleano

# bls::variable_type::DATETIME
source: date
it: data

# bls::variable_type::FLOAT
source: float
it: num. float

# bls::variable_type::INTEGER
source: integer
it: num. intero

# bls::variable_type::NUMBER
source: decimal
it: num. decimale

# bls::variable_type::POINTER
source: pointer
it: puntatore

# bls::variable_type::STRING
source: string
it: stringa
